# Person re-identification embedder for cross-camera identity fusion.
name: "reid"
platform: "tensorrt_plan"
max_batch_size: 32
input [
  { name: "crops", data_type: TYPE_FP16, dims: [ 3, 256, 128 ] }
]
output [
  { name: "embedding", data_type: TYPE_FP16, dims: [ 512 ] }
]
dynamic_batching { preferred_batch_size: [ 8, 16, 32 ] max_queue_delay_microseconds: 1000 }
instance_group [ { count: 1, kind: KIND_GPU } ]
