# RT-DETR "challenger" — stronger under occlusion; run in shadow mode.
name: "detector_rtdetr"
platform: "tensorrt_plan"
max_batch_size: 8
input [
  { name: "images", data_type: TYPE_FP16, dims: [ 3, 640, 640 ] }
]
output [
  { name: "output0", data_type: TYPE_FP16, dims: [ -1, 6 ] }
]
dynamic_batching {
  preferred_batch_size: [ 4, 8 ]
  max_queue_delay_microseconds: 3000
}
instance_group [ { count: 1, kind: KIND_GPU } ]
